In [1]:
import pandas as pd

In [18]:
valores = [6,8, 34, 94, 78]
indice = range (len(valores))

serie1= pd.Series(data = valores, index = indice)
serie1

0     6
1     8
2    34
3    94
4    78
dtype: int64

In [19]:
valores2 = [28, 45, 852, 3, 16]
serie2 = pd.Series(index= indice, data=valores2)
serie2

0     28
1     45
2    852
3      3
4     16
dtype: int64

In [15]:
serie1 + serie2

0     34
1     53
2   -818
3     97
4    -62
dtype: int64

In [16]:
serie1 / serie2

0     0.214286
1     0.177778
2    -0.039906
3    31.333333
4    -4.875000
dtype: float64

In [20]:
serie1 ** serie2

0   -1823562080465190912
1                      0
2                      0
3                 830584
4    3945326505906733056
dtype: int64

In [21]:
import numpy as np

In [22]:
array = np.random.normal (-10,10, size = [4,4])
array

array([[ -4.07722384, -17.33696883,   3.2856241 ,   3.22611145],
       [  1.29940481, -27.2238882 ,   7.73952724, -12.97990182],
       [-32.07815322,   6.67455675, -14.57230757, -13.95841207],
       [ -9.51803791, -10.08210149,   1.65211226,  -1.40807184]])

In [23]:
pd.DataFrame ([[2,3], [4,5]], index=['a','b'],columns=['W','X'])

   W  X
a  2  3
b  4  5

In [24]:
pd.DataFrame(array)

           0          1          2          3
0  -4.077224 -17.336969   3.285624   3.226111
1   1.299405 -27.223888   7.739527 -12.979902
2 -32.078153   6.674557 -14.572308 -13.958412
3  -9.518038 -10.082101   1.652112  -1.408072

In [51]:
df = pd.DataFrame(array, index=range(1, len(array)+1), columns= ['W', 'X','Y','Z'])
df

           W          X          Y          Z
1  -4.077224 -17.336969   3.285624   3.226111
2   1.299405 -27.223888   7.739527 -12.979902
3 -32.078153   6.674557 -14.572308 -13.958412
4  -9.518038 -10.082101   1.652112  -1.408072

In [32]:
df ['X'][2]
## indexar

np.float64(-27.22388820115693)

In [33]:
df ['X']

1   -17.336969
2   -27.223888
3     6.674557
4   -10.082101
Name: X, dtype: float64

In [35]:
df[['W','Y']]

## el primer corchete es para hacer un slicing, el segundo es para decirle las columnas que nos interesan, slicing sobre una lista

           W          Y
1  -4.077224   3.285624
2   1.299405   7.739527
3 -32.078153 -14.572308
4  -9.518038   1.652112

In [36]:
df.X + df.Z

1   -14.110857
2   -40.203790
3    -7.283855
4   -11.490173
dtype: float64

In [ ]:
## los dataframe son mutables

In [62]:
df['suma_X_Z']= df.X + df.Z
df

           W          X          Z   suma_X_Z
1  -4.077224 -17.336969   3.226111 -14.110857
2   1.299405 -27.223888 -12.979902 -40.203790
3 -32.078153   6.674557 -13.958412  -7.283855
4  -9.518038 -10.082101  -1.408072 -11.490173

In [52]:
## para borrar una columna 
# se usa el metodo dropear 

df.drop('Y', axis=1)

## axis es un eje de 0 a 1, para especificar 1 es para columnas y 0 es para filas

           W          X          Z
1  -4.077224 -17.336969   3.226111
2   1.299405 -27.223888 -12.979902
3 -32.078153   6.674557 -13.958412
4  -9.518038 -10.082101  -1.408072

In [61]:
df

### si lo vuelvo a imprimir sale otra vez sale Y, porque el drop solo es un borrador, para eso tendriamos que reemplazar las columnas

           W          X          Z
1  -4.077224 -17.336969   3.226111
2   1.299405 -27.223888 -12.979902
3 -32.078153   6.674557 -13.958412
4  -9.518038 -10.082101  -1.408072

In [53]:
df.drop('Y', axis=1, inplace=True)
df

           W          X          Z
1  -4.077224 -17.336969   3.226111
2   1.299405 -27.223888 -12.979902
3 -32.078153   6.674557 -13.958412
4  -9.518038 -10.082101  -1.408072

In [54]:
df.drop(3, axis=0)

          W          X          Z
1 -4.077224 -17.336969   3.226111
2  1.299405 -27.223888 -12.979902
4 -9.518038 -10.082101  -1.408072

In [55]:
df.loc[3]

## para filas, loc es localizar

W   -32.078153
X     6.674557
Z   -13.958412
Name: 3, dtype: float64

In [56]:
### otra forma de acceder a las filas es con la localizacion de 
df.iloc [0]

W    -4.077224
X   -17.336969
Z     3.226111
Name: 1, dtype: float64

In [57]:
df.iloc [[0,2]]

           W          X          Z
1  -4.077224 -17.336969   3.226111
3 -32.078153   6.674557 -13.958412

In [ ]:
## si yo quiero acceder a un solo valor puedo hacer una combinacion de estas dos

In [58]:
df.loc[3, 'X']

np.float64(6.674556745906088)

In [63]:
df.loc[[2,4], ['X', 'suma_X_Z']]

           X   suma_X_Z
2 -27.223888 -40.203790
4 -10.082101 -11.490173